docs/posts/2016-12-21-christmas-communion-liturgy.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 28, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Christmas Communion Liturgy</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Christmas Communion Liturgy</h1>
<p class="subtitle" role="doc-subtitle">Dec 21, 2016</p>
</header><p>
Peace be with you,
</p>

<p>
When a new emperor took the throne in Rome, messengers were sent to the rich and powerful to deliver &ldquo;glad tidings&rdquo; of Caesar, who was called &ldquo;savior and lord&rdquo; and promised to bring peace to the empire through the power of his vast riches and his mighty armies.
</p>

<p>
But when the King was born in Bethlehem, messengers from God were sent, not to the rich and powerful, but to those too poor to be noticed by the empire.
</p>

<p>
And for the first time, they heard glad tidings of good news, that peace would come to the world, not by the power of force, but by the power of love, not through a conquering army, but through the crucified Christ.
</p>

<p>
The messiah had come, but the city of Bethlehem was unprepared. There was no welcome; there was no room. His birth was largely ignored by the powerful, and noticed only by some shepherds and a few foreigners.
</p>

<p>
We, like Bethlehem, were also unprepared, but thanks be to God that even in our uncertainty, Christ called to us; even in our hesitation, Christ came to us; even in our sin, Christ died for us.
</p>

<p>
Christmas reminds us that ready or not, God has come into the world, and we are not alone. By sharing communion together we recognize and remember God&rsquo;s presence and proclaim the great mystery of the faith:<br>
</p>

<p>
Christ has died,<br>
Christ has risen,<br>
and Christ will come again.
</p>

<p>
We stand before the table, surrounded by God&rsquo;s people, who will soon partake together — powerful symbols of God&rsquo;s presence and his grace.
</p>

<p>
God before you,<br>
God around you,<br>
God within you.
</p>

<p>
Come to his table.
</p>

<p>
<i>Taking of the bread.</i>
</p>

<p>
Christ&rsquo;s body was broken not just to make a statement, and not merely for the sake of some cause.
</p>

<p>
Christ&rsquo;s body was broken for you, and for me.
</p>

<p>
Eat, and remember.
</p>

<p>
<i>Taking of the cup.</i>
</p>

<p>
Just as his body was broken, his blood was shed, and God died, so that we may live.
</p>

<p>
Drink, and give thanks.
</p>

<p>
<i>Amen</i>
</p>



<div class="tagline" id="org901955a">
<p>
Tagged: <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 28, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
